cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'aws/tap'
tap 'd12frosted/emacs-plus'
tap 'adoptopenjdk/openjdk'
tap 'xwmx/taps'
# tap 'puma/puma'

brew 'ag'
brew 'ack'
brew 'ansible'
brew 'awscli'
brew 'aws-shell'
brew 'aws/tap/aws-sam-cli'
brew 'cmake' # some emacs modules require this for build/upgrad
brew 'composer'
brew 'coreutils'
brew 'curl-openssl'
brew 'dialog' # fails to update as a mere dependency
brew 'doxygen'
brew 'emacs-plus'
brew 'fd' # for DOOM emacs
brew 'flyway'
brew 'gcc'
brew 'git'
brew 'git-lfs'
brew 'glib'
brew 'ghostscript'
brew 'go'
brew 'graphviz'
brew 'grc'
brew 'helm'
brew 'htop'
brew 'httpie'
# brew 'hyperkit'  # seems to conflict with docker for mac
brew 'imagemagick'
brew 'jansson'
brew 'jp2a'
brew 'jq'
# brew 'kubernetes-cli'
# brew 'kubernetes-helm'
# brew 'libgit2'
brew 'minikube'
brew 'mono'
brew 'mysql'
brew 'nb'
brew 'neo4j'
brew 'openssl'
brew 'oniguruma'
brew 'pandoc'
brew 'pandoc-crossref'
brew 'plantuml'
brew 'poetry'
brew 'p7zip'
brew 'qt' # fails to update as a mere dependency
brew 'r'
brew 'readline'
brew 'rg'  # for DOOM emacs
brew 'rsync'
brew 'ruby'
brew 'sdl2'  # fails to update as a mere dependency 
brew 'socat'
brew 'shellcheck'  # for DOOM emacs
brew 'spark'
brew 'sqlite'
# brew 'syncthing'  # ITACS requested removal of this
brew 'telnet' # for talking to android emulators
brew 'terraform'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'wget'
brew 'zsh'

#################
# One-time use items, comment out after initial run of updot
# cask homebrew/cask-versions/adoptopenjdk8
# cask 'adobe-acrobat-reader' # Can't seem to update itself
# cask 'Boxcryptor' # fails after first install
# cask 'firefox'  # Updates itself
# cask 'jetbrains-toolbox'  # manages itself
# cask 'omnifocus'  # manages itself
# cask 'omnigraffle'  # manages itself
# cask 'steam'  # manages itself
# cask 'tower' # Using the public beta, manage manually
# cask 'transmit'  # get via app store instead
# cask 'visual-studio-code'
# cask 'google-chrome'
# cask 'alfred'
# cask 'dash'
# cask 'discord'
# cask 'docker'
# cask 'evernote'
# cask 'istat-menus'
# cask 'iterm2'
# cask 'kaleidoscope'
# cask 'keybase'
# cask 'kindle'
# cask 'sublime-text'
# cask 'oracle-jdk'
# cask 'microsoft-teams'
##################
# cask 'zettlr' # manage manually due to using beta releases
##################
# cask 'Boxcryptor'
# cask 'java'
cask 'anaconda'
cask 'font-ibm-plex'
cask 'font-inconsolata-nerd-font'
cask 'font-cascadia-code'
cask 'font-cascadia-mono'
cask 'font-hackgen'
cask 'mactex'
# cask 'neo4j' use a docker container instead.
cask 'netnewswire'
cask 'ngrok'
# cask 'slack'
cask 'transmission'
cask 'tiled' ## game level editor
cask 'sizeup'
cask 'vagrant'
cask 'brewservicesmenubar'
cask 'zotero'

