cask_args appdir: '/Applications'

tap 'homebrew/bundle'
# tap 'puma/puma'

brew 'ack'
brew 'ansible'
brew 'awscli'
brew 'certbot'
brew 'coreutils'
brew 'doxygen'
brew 'git'
brew 'go'
brew 'gcc'
brew 'grc'
brew 'httpie'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'kubectl'
brew 'kubernetes-helm'
# brew 'libgit2'
brew 'mono'
brew 'mysql'
brew 'nvm'
brew 'openssl'
brew 'oniguruma'
brew 'pandoc'
brew 'p7zip'
brew 'readline'
brew 'socat'
brew 'spark'
brew 'tmux'
brew 'tree'
brew 'unrar'
brew 'vim'
brew 'wget'
brew 'zsh'

#cask '1password'  # Problematic to install this way (mulitiple copy issues)
cask 'adium'
cask 'adobe-reader'
cask 'alfred'
cask 'anaconda'
cask 'Boxcryptor'
cask 'box-sync'
cask 'dash'
cask 'discord'
cask 'docker'
cask 'evernote'
cask 'eclipse-installer'
# cask 'fantastical'   get from app store instead
cask 'firefox'
cask 'google-chrome'
cask 'istat-menus'
cask 'iterm2'
cask 'java'
cask 'jetbrains-toolbox'
cask 'kaleidoscope'
cask 'kindle'
cask 'mactex'
cask 'netbeans-java-se'
cask 'netnewswire'
cask 'ngrok'
cask 'omnifocus'
cask 'omnigraffle'
cask 'skype'
cask 'slack'
cask 'steam'
cask 'sublime-text'
cask 'tower'
# cask 'transmit'  # get via app store instead
cask 'transmission'
cask 'resilio-sync'
cask 'sequel-pro'
cask 'sizeup'
# cask 'unity-download-assistant' # confuses things when you have more than one unity install.


