cask_args appdir: '/Applications'

tap 'homebrew/bundle'
# tap 'puma/puma'

brew 'ack'
brew 'ansible'
brew 'awscli'
brew 'aws-shell'
brew 'composer'
brew 'coreutils'
brew 'doxygen'
brew 'gcc'
brew 'git'
brew 'git-lfs'
brew 'glib'
brew 'go'
brew 'grc'
brew 'htop'
brew 'httpie'
brew 'imagemagick'
brew 'jansson'
brew 'jp2a'
brew 'jq'
# brew 'kubernetes-cli'
# brew 'kubernetes-helm'
# brew 'libgit2'
brew 'mono'
brew 'mysql'
brew 'neo4j'
brew 'openssl'
brew 'oniguruma'
brew 'pandoc'
brew 'p7zip'
brew 'r'
brew 'readline'
brew 'ruby'
brew 'sdl2'  # This is some other package's dependency but it won't upgrade if not listed here for some reason. 
brew 'socat'
brew 'spark'
brew 'sqlite'
brew 'terraform'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'unrar'
# brew 'vim'
brew 'wget'
brew 'zsh'

#cask '1password'  # Problematic to install this way (mulitiple copy issues)
# cask 'adium' # not using
# cask 'adobe-acrobat-reader' # Can't seem to update itself
cask 'alfred'
# cask 'anaconda' # Pycharm can't find it if installed with brew, use the regular Anaconda installer instead
# cask 'Boxcryptor' # Update never seems to work
# cask 'box-sync'
cask 'dash'
cask 'discord'
cask 'docker'
cask 'evernote'
cask 'eclipse-installer'
# cask 'fantastical'   get from app store instead
cask 'firefox'
cask 'google-chrome'
cask 'istat-menus'
cask 'iterm2'
cask 'java'
cask 'jetbrains-toolbox'
cask 'kaleidoscope'
cask 'keybase'
cask 'kindle'
cask 'mactex'
cask 'netbeans-java-se'
cask 'netnewswire'
cask 'ngrok'
cask 'omnifocus'
cask 'omnigraffle'
cask 'skype'
cask 'slack'
cask 'steam'
cask 'sublime-text'
# cask 'tower' # Using the public beta, manage manually
# cask 'transmit'  # get via app store instead
cask 'transmission'
cask 'resilio-sync'
cask 'sequel-pro'
cask 'sizeup'
cask 'yakyak'
# cask 'unity-download-assistant' # confuses things when you have more than one unity install.


